Repository: aelkheir/skulebot
Catalog: src/locales/*/LC_MESSAGES/*.po
Languages: ar

source: /academicyears description
ar: تحديث الاعوام الدراسية

source: /ai description
ar: تفعليل/الغاء تفعيل وضع الذكاء الاصطناعي

source: /broadcast description
ar: بث رسالة للمستخدمين

source: /contentmanagement description
ar: الاشراف على المحتويات المرفوعة

source: /coursemanagement description
ar: تحديث اوصاف المواد

source: /courses description
ar: اعرض المواد الحالية

source: /departments description
ar: تحديث اوصاف الاقسام

source: /editor1 description
ar: تقدم بطلب صلاحية لرفع المحتويات

source: /editor2 description
ar: التحكم في صلاحيات النشر

source: /empty to clear {}
ar: اكتب /empty لحذف قيمة {} الحالية

source: /enrollments1 description
ar: سجل في تخصصك ومستواك

source: /enrollments2 description
ar: تحديث التسجيل

source: /pending description
ar: قبول ورفض طلبات المحررين

source: /programs description
ar: تحديث اوصاف التخصصات ومناهجها

source: /semesters description
ar: تحديث السمسترات

source: /settings description
ar: اضبط اعدادات البوت

source: /updatematerials description
ar: رفع محتويات للمواد الحالية

source: /users description
ar: ابحث عن المستخدمين

source: AI activated
ar: تم تفعيل وضع الذكاء الاصطناعي.

source: AI deactivated
ar: تم الغاء تفعيل وضع الذكاء الاصطناعي.

source: Academic years
ar: الاعوام الاكاديمية

source: Access for year {}
ar: صلاحية النشر {}

source: Activate
ar: تفعيل

source: Add {}
ar: اضافة {}

source: Admin call for action {fullname} {mention} {enrollment}
ar: طلب صلاحية نشر: {mention} يطلب {fullname} صلاحية للنشر في التسجيل {enrollment}

source: All Enrolled Students
ar: جميع الطلاب

source: All Users
ar: كل المستخدمين

source: All set.
ar: جاهز

source: Already applied for access
ar: يبدو أنه يوجد طلب من قبل! استخدم /publish لمتابعة الحالة.

source: Already enrolled
ar: عفواً، يبدو انه قد تم تسجيلك لهذا العام. حاول /courses لعرض قائمة المواد الحالية.

source: Already published
ar: تم نشره من قبل

source: April
ar: ابريل

source: Arabic
ar: العربية

source: August
ar: اغسطس

source: Back
ar: « رجوع

source: Back to {}
ar: رجوع ل{}

source: Bot Settings
ar: اعدادات البوت

source: Bot bio
ar: بوت طلاب العلوم الرياضية

source: Bot description
ar: أُساعدك في العثور على محتويات المواد بصورة اكثر سهولة. في حال مواجهة اي صعوبات، نرجوا ان تتواصل مع @skulebotsupport

source: Broadcast
ar: بث

source: Calendar
ar: جدول

source: Can't publish no files
ar: لايمكن النشر بدون ملفات!

source: Carriculam
ar: المنهج

source: Commands
ar: الأوامر

source: Confirm delete warning {}
ar: هل انت متاكد <b>تماماَ</b> انك تود ان تحذف {}؟

source: Confirm revoke {}
ar: هل انت متاكد <b>تماماَ</b> انك تود ان تسحب {}؟

source: Congratulations! New access
ar: تم قبول طلبك لنشر المحتويات 🎉!

source: Contact
ar: تواصل

source: Content Management
ar: ادارة المحتويات

source: Course
ar: المادة

source: Course Management
ar: ادارة المواد

source: Course already present
ar: المادة مبروطة مع نفس السمستر مسبقاً

source: Course linked to other semester {}
ar: المادة مربوطة في سمستر مختلف ({})، هل ترغب في التحديث؟

source: Course {}
ar: مادة {}

source: Courses
ar: المواد

source: Credits
ar: الساعات

source: Credits: {}
ar: الساعات: {}

source: Custom
ar: آخر

source: Date
ar: التاريخ

source: Deactivate
ar: الغاء التفعيل

source: Deadline
ar: اخر موعد

source: Deadline date selected {}
ar: حسناً، قمت باختيار <b>{}</b>، الآن ادخل الوقت بنظام ال 24 ساعة بتوقيت الخرطوم <pre>[h]h:[m]m</pre>

source: Deadline passed
ar: مرّ زمن التسليم

source: December
ar: ديسمبر

source: Delete
ar: حذف

source: Delete warning {}
ar: انت على وشك حذف {}. هل هذا صحيح؟

source: Delete {}
ar: حذف ال{}

source: Department
ar: القسم

source: Department {}
ar: قسم {}

source: Departments
ar: الاقسام

source: Disable All
ar: الغاء الكل

source: Disenroll
ar: الغاء التسجل

source: Display
ar: عرض

source: Don't Notify
ar: بدون تنبيهات

source: Done broadcasting message
ar: انتهى بث الرسالة

source: Done sending notifications
ar: تم ارسال التنبيهات!

source: Done sending reminders
ar: تم ارسال تنبيهات التساليم القريبة!

source: Done! No reminders to send
ar: تم! لا يوجد تسليم قريب.

source: Done! No users to broadcast to
ar: تم! لا يوجد مستخدمين للبث.

source: Edit {}
ar: تعديل {}

source: Editor Access
ar: صلاحيات النشر

source: Editor Menu
ar: قائمة النشر

source: Enable AI to continue.
ar: فعل وضع الذكاء الاصطناعي للمتابعة.

source: English
ar: الانجليزية

source: Enroll Now
ar: سجِّل الآن

source: Enrollment
ar: تسجيل

source: Enrollment {} - {}
ar: تسجيل {} - {}

source: Enrollments
ar: التسجيل

source: February
ar: فبراير

source: Fifth Year
ar: المستوى الخامس

source: File
ar: ملف

source: First Year
ar: المستوى الأول

source: Fourth Year
ar: المستوى الرابع

source: Fri
ar: جمعة

source: Full name
ar: الإسم

source: General Department
ar: القسم العام

source: Get All
ar: ارسل الكل

source: Grant Access
ar: امنح الصلاحية

source: Hell no
ar: قطعاً لا

source: How editing works
ar: شكراً لتقديم المساعدة! 😊 اذا كان لديك انترنت مستقر نسبياً، يمكنك ان تشارك في رفع محتويات المواد. نبحث عن اشخاص على الاستعداد بالتزام متوسط لطويل الأمد، يفضل سمستر كامل او اكثر. الآن نظراً لان البوت مفتوح للجميع، نحتاج فقط للتحقق من تسجيلك. يوجد طريقتان. يمكنك ان ترسل اي ما تراه يثبت ذلك، أو اذا لم يكن لديك وسيلية تحقيق، تواصل معنا وسنقوم بالترتيب معاً. 📚

source: January
ar: ياناير

source: July
ar: يوليو

source: June
ar: يونيو

source: Language
ar: اللغة

source: Level
ar: المستوى

source: Link Course
ar: اربط مادة

source: March
ar: مارس

source: May
ar: مايو

source: Mon
ar: أثنين

source: Name in Arabic {} and English {}
ar: الاسم بالعربية: {} الاسم بالانجليزية: {}

source: Name in {}
ar: الاسم ب{}

source: Next
ar: التالي

source: No
ar: لا

source: No editor warning {}
ar: [لا أحد معه صلاحية النشر، يمكنك ان تصبح منهم هنا /{}.]

source: No id intro message {}
ar: [صلاحية نشر] {}

source: No value
ar: لا يوجد

source: Nope
ar: كلا

source: Nothing coming soon
ar: لا شئ في الأيام المقبلة!

source: Nothing for this day!
ar: لا شئ في هذا اليوم!

source: Notifications
ar: التنبيهات

source: Notify
ar: ارسل تنبيهاً

source: November
ar: نوفمبر

source: Number
ar: الرقم

source: October
ar: اكتوبر

source: Optional
ar: اختياري

source: Optional Courses
ar: المواد الاختيارية

source: Pending
ar: جارٍ

source: Pending access requests
ar: طلبات الصلاحية المعلقة

source: Preview
ar: عرض

source: Program
ar: التخصص

source: Programs
ar: التخصصات

source: Publish
ar: نشر

source: Published false
ar: (غير منشور)

source: Published true
ar: (تم نشره)

source: Publishing Options
ar: هل ترغب في ارسال تنبيهات؟

source: Reject
ar: رفض

source: Reminder
ar: تذكير

source: Request Access
ar: اطلب صلاحية

source: Required
ar: اجباري

source: Results
ar: النتائج

source: Revoke Access
ar: سحب الصلاحية

source: Revoke {}
ar: انت على وشك ان تسحب {}. هل هذا صحيح؟

source: Sat
ar: سبت

source: Search
ar: بحث

source: Search users
ar: ابحث المستخدمين

source: Second Year
ar: المستوى الثاني

source: Select action
ar: اختر اجراء

source: Select group to braodcast to
ar: اختر مجموعة لتبث اليها

source: Select message language
ar: اختر لغة الرسالة

source: Select optional courses
ar: هذه المواد اختياربة. اختر منها للاضافة لقائمة /courses.

source: Select {}
ar: اختر {}

source: Semester
ar: سمستر

source: Semester number
ar: رقم السمستر

source: Semester {}
ar: سمستر {}

source: Semesters
ar: السمسترات

source: Send
ar: ارسل

source: Send & Pin
ar: ارسل & علق

source: Send files ({})
ar: ارسل الملفات ({})

source: Send me your proof
ar: حسناً. ارسل ما ياكد تسجيلك (صورة، ملف)

source: September
ar: سبتمبر

source: Show Less
ar: القليل

source: Show More
ar: المزيد

source: Source
ar: المصدر

source: Specific Batch
ar: دفعة محددة

source: Started Broadcasting the message
ar: بدأ بث الرسالة

source: Started assignment deadline reminders
ar: بدأ ارسال تنبهات للتساليم القريبة.

source: Started sending notifications
ar: بدأ ارسال التنبيهات

source: Students Missing Publishers
ar: الطلاب بلا ناشر

source: Submit Proof
ar: ارسل اثبات

source: Success!
ar: نجاح!

source: Success! All notifications are Off
ar: تم! كل التنبيهات ملغية

source: Success! Deadline reminder set
ar: سيتم ارسال تذكير قبل يوم ونصف على الاقل.

source: Success! Deadline set {}
ar: نجاح! موعد التسليم وضع ل <b>{}</b>.

source: Success! {} added
ar: نجاح! تمت اضافة {}

source: Success! {} created
ar: نجاح! تم انشاء {}

source: Success! {} deleted
ar: نجاح! تم حذف {}

source: Success! {} linked
ar: نجاح! تم ربط {}

source: Success! {} published
ar: نجاح! تم نشر {}

source: Success! {} removed
ar: نجاح! تم حذف {}

source: Success! {} revoked
ar: نجاح! تم سحب {}

source: Success! {} unlinked
ar: نجاح! تم الغاء ربط {}

source: Success! {} updated
ar: نجاح! تم تحديث {}

source: Sun
ar: أحد

source: Telegram id
ar: معرّف التيليقرام

source: Thanks for applying {}
ar: مجهودك مقدّر! استلمنا طلبك وسنعاودك الاتصال قريبا. في الوقت الحالي يمكنك متابعة حالة الطلب على /{}.

source: Third Year
ar: المستوى الثالث

source: Thu
ar: خميس

source: Tue
ar: ثلاث

source: Type
ar: النوع

source: Type date
ar: ادخل التاريخ على الصورة <pre>[20]yy-mm[-dd]</pre>

source: Type link
ar: ارسل رابط

source: Type message
ar: اكتب الرسالة

source: Type message in {}
ar: اكتب الرسالة ب{}

source: Type multilingual name
ar: اكتب الاسم على الشكل <pre>الاسم بالانجليزية - الاسم بالعربية</pre>

source: Type name in {}
ar: اكتب الاسم ب{}

source: Type number
ar: ادخل رقم

source: Type year
ar: اكتب العام على الشكل yyyy - yyyy

source: Unlink Course
ar: الغاء الربط

source: Update to Semeter {}
ar: حدث لسمستر {}

source: User
ar: مستخدم

source: Username
ar: اسم المستخدم

source: Users
ar: المستخدمين

source: Wed
ar: أربع

source: Would you like to provide a translation in an another language
ar: هل تود في اضافة ترجمة اخرى للرسالة

source: Year
ar: العام

source: Year {} - {}
ar: العام {} - {}

source: Yes that's correct
ar: نعم هذا صحيح

source: Yes, I'm 100% sure!
ar: نعم، انا متاكد 100%!

source: You have been enrolled
ar: تم تسجيلك 🎉!

source: Your commands have been Updated
ar: هذه قائمة محدثة من الأوامر. يمكنك عرضها دوماً باستعمال /help.

source: Your enrollments
ar: التسجيل

source: Your request is pending
ar: طلبك قيد الاجراء. سنعاودك الاتصال قريباً. مع الشكر

source: assignment
ar: تسليم

source: assignments
ar: التساليم

source: due by
ar: بحلول

source: in Khartoum timezone
ar: بتوقيت الخرطوم

source: lab
ar: معمل

source: labs
ar: المعامل

source: lecture
ar: محاضرة

source: lectures
ar: المحاضرات

source: more item
ar: عنصر آخر

source: new
ar: جديد

source: publish-guide
ar: <u>دليل استخدام البوت لاضافة المحتويات</u> الرجاء متابعة الدليل اعلاه جيداً.

source: reference
ar: مرجع

source: references
ar: المراجع

source: review
ar: اختبار

source: reviews
ar: الاختبارات

source: sheet
ar: شيت

source: sheets
ar: الشيتات

source: time remaining {} {}
ar: {} و{}

source: tool
ar: أداة

source: tools
ar: الأدوات

source: tutorial
ar: تمرين

source: tutorials
ar: التمارين

source: {} of {}
ar: {} من {}

source: {} of {} is due in {}
ar: {} من مادة {} بقي عليه {}
